//=========================================================
//
// チュートリアル画面処理 [tutorial.h]
// Author = 阿部翔大郎
//
//=========================================================
#ifndef _TUTORIAL_H_     // このマクロ定義がされてなかったら
#define _TUTORIAL_H_     // 2重インクルード防止のマクロ定義する

#include "manager.h"

//===============================================
// 前方宣言
//===============================================

//===============================================
// 前方宣言
//===============================================
#define MAX_DUMPSTER_TUTORIAL			(2)			// 最大ゴミステーション配置数

//===============================================
// チュートリアル画面クラス
//===============================================
class CTutorial : public CScene
{
public:		// 誰でもアクセス可能 [アクセス指定子]
	CTutorial();						// デフォルトコンストラクタ
	~CTutorial();						// デストラクタ

	HRESULT Init(HWND hWnd);
	void Uninit(void);
	void Update(void);
	void Draw(void);

private:	// 自分のみアクセス可能 [アクセス指定子]

	int m_nTime;		// 経過時間をカウント
	bool m_bFade;		// フェードに入ったか
};

#endif